-- =====================================================================
-- БАЗОВЫЕ НАСТРОЙКИ NEOVIM
-- =====================================================================

-- Установка алиасов для конфига
local opt = vim.opt
local g = vim.g

-- ---------------------------------------------------------------------
-- Общие параметры
-- ---------------------------------------------------------------------


-- ---------------------------------------------------------------------
-- Интерфейс
-- ---------------------------------------------------------------------

opt.number = true                   -- показывать номера строк
opt.relativenumber = true           -- относительные номера строк
opt.cursorline = true               -- подсветка линии на которой курсор
opt.shiftwidth = 4                  -- табуляция 4 пробела
